spec/support/vcr_cassettes/bgs/service/create_relationship.yml

---
http_interactions:
- request:
    method: get
    uri: https://localhost:4447/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 May 2020 16:17:19 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" name="VnpPtcpntRlnshpService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpPtcpntRlnshpUpdate">
        <part name="parameters" element="tns:vnpPtcpntRlnshpUpdate"/>
        </message>
        <message name="vnpPtcpntRlnshpUpdateResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpUpdateResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpPtcpntRlnshpCreate">
        <part name="parameters" element="tns:vnpPtcpntRlnshpCreate"/>
        </message>
        <message name="vnpPtcpntRlnshpCreateResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpCreateResponse"/>
        </message>
        <message name="vnpPtcpntRlnshpRemove">
        <part name="parameters" element="tns:vnpPtcpntRlnshpRemove"/>
        </message>
        <message name="vnpPtcpntRlnshpRemoveResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpRemoveResponse"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="vnpPtcpntRlnshpFindByPrimaryKey">
        <part name="parameters" element="tns:vnpPtcpntRlnshpFindByPrimaryKey"/>
        </message>
        <message name="vnpPtcpntRlnshpFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpPtcpntRlnshpFindByPrimaryKeyResponse"/>
        </message>
        <portType name="VnpPtcpntRlnshpService">
        <operation name="vnpPtcpntRlnshpUpdate">
        <input message="tns:vnpPtcpntRlnshpUpdate"/>
        <output message="tns:vnpPtcpntRlnshpUpdateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRlnshpCreate">
        <input message="tns:vnpPtcpntRlnshpCreate"/>
        <output message="tns:vnpPtcpntRlnshpCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRlnshpRemove">
        <input message="tns:vnpPtcpntRlnshpRemove"/>
        <output message="tns:vnpPtcpntRlnshpRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input message="tns:findAllAsArray"/>
        <output message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpPtcpntRlnshpFindByPrimaryKey">
        <input message="tns:vnpPtcpntRlnshpFindByPrimaryKey"/>
        <output message="tns:vnpPtcpntRlnshpFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpPtcpntRlnshpServicePortBinding" type="tns:VnpPtcpntRlnshpService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpPtcpntRlnshpUpdate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRlnshpCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRlnshpRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpPtcpntRlnshpFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpPtcpntRlnshpService">
        <port name="VnpPtcpntRlnshpServicePort" binding="tns:VnpPtcpntRlnshpServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService"/>
        </port>
        </service>
        </definitions>
    http_version: null
  recorded_at: Tue, 26 May 2020 16:17:20 GMT
- request:
    method: post
    uri: http://linktestbepbenefits.vba.va.gov/VnpPtcpntRlnshpWebServiceBean/VnpPtcpntRlnshpService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>192.168.1.239</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>19271627073525420</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpPtcpntRlnshpCreate><arg0><vnpPtcpntRlnshpId xsi:nil="true"/><beginDt xsi:nil="true"/><childPrevlyMarriedInd xsi:nil="true"/><endDt xsi:nil="true"/><eventDt xsi:nil="true"/><familyRlnshpTypeNm>Spouse</familyRlnshpTypeNm><fidAttntnTxt xsi:nil="true"/><hlthcrPrvdrRlseInd xsi:nil="true"/><jrnDt>2020-05-26T16:17:19Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><livesWithRelatdPersonInd xsi:nil="true"/><marageCityNm>Tampa</marageCityNm><marageCntryNm xsi:nil="true"/><marageStateCd></marageStateCd><marageTrmntnCityNm xsi:nil="true"/><marageTrmntnCntryNm xsi:nil="true"/><marageTrmntnStateCd xsi:nil="true"/><marageTrmntnTypeCd xsi:nil="true"/><mthlySupportFromVetAmt xsi:nil="true"/><proofDepncyInd xsi:nil="true"/><prptnlPhraseTypeNm xsi:nil="true"/><ptcpntRlnshpTypeNm>Spouse</ptcpntRlnshpTypeNm><rateTypeNm xsi:nil="true"/><reviewDt xsi:nil="true"/><statusTypeCd xsi:nil="true"/><tempCustdnInd xsi:nil="true"/><poaRepNm xsi:nil="true"/><poaRepTitleTxt xsi:nil="true"/><poaSigntrVrfctnDt xsi:nil="true"/><poaRepTypeCd xsi:nil="true"/><poaAgencyNm xsi:nil="true"/><vnpProcId>3828728</vnpProcId><vnpPtcpntIdA>147891</vnpPtcpntIdA><vnpPtcpntIdB>147891</vnpPtcpntIdB></arg0></tns:vnpPtcpntRlnshpCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpPtcpntRlnshpCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '2227'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.17.9
      Date:
      - Tue, 26 May 2020 16:17:21 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Content-Length:
      - '1606'
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></S:Header><S:Body><ns2:vnpPtcpntRlnshpCreateResponse
        xmlns:ns2="http://ptcpntRlnshpService.services.vonapp.vba.va.gov/"><return><vnpPtcpntRlnshpId>77500</vnpPtcpntRlnshpId><childPrevlyMarriedInd></childPrevlyMarriedInd><familyRlnshpTypeNm>Spouse</familyRlnshpTypeNm><fidAttntnTxt></fidAttntnTxt><hlthcrPrvdrRlseInd></hlthcrPrvdrRlseInd><jrnDt>2020-05-26T16:17:19Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId><livesWithRelatdPersonInd></livesWithRelatdPersonInd><marageCityNm>Tampa</marageCityNm><marageCntryNm></marageCntryNm><marageStateCd></marageStateCd><marageTrmntnCityNm></marageTrmntnCityNm><marageTrmntnCntryNm></marageTrmntnCntryNm><marageTrmntnStateCd></marageTrmntnStateCd><marageTrmntnTypeCd></marageTrmntnTypeCd><proofDepncyInd></proofDepncyInd><prptnlPhraseTypeNm></prptnlPhraseTypeNm><ptcpntRlnshpTypeNm>Spouse</ptcpntRlnshpTypeNm><rateTypeNm></rateTypeNm><statusTypeCd></statusTypeCd><tempCustdnInd></tempCustdnInd><poaRepNm></poaRepNm><poaRepTitleTxt></poaRepTitleTxt><poaRepTypeCd></poaRepTypeCd><poaAgencyNm></poaAgencyNm><vnpProcId>3828728</vnpProcId><vnpPtcpntIdA>147891</vnpPtcpntIdA><vnpPtcpntIdB>147891</vnpPtcpntIdB></return></ns2:vnpPtcpntRlnshpCreateResponse></S:Body></S:Envelope>
    http_version: null
  recorded_at: Tue, 26 May 2020 16:17:21 GMT
recorded_with: VCR 5.1.0
